#include "ui.h"
#include <iostream>

using namespace ui;

void informing::outGretting() {
    cout << "Добро пожаловать в програмную реализацию Контрольной работы №1" << endl;
}

void informing::printInputWays() {

    cout << "-----..........-----..........-----..........-----" << endl;
    cout << "Пожалуйста выберете, как вы бы хотели заполнить данные или вы хотите запустить модульные тесты ?" << endl;
    cout << "Используйте пункты меню для навигации в программе, нажмите :" << endl;
    cout << "[1] - если хотите взять данные из файла" << endl;
    cout << "[2] - если хотите ввести данные в консоли" << endl;
    cout << "[3] - если хотите запустить модульные тесты" << endl;
    cout << "[0] - если хотите выйти! до свидания!" << endl << endl;
}

void informing::printAction() {
    cout << "-----..........-----..........-----..........-----" << endl;
    cout << "Пожалуйста выберете, что вы хотите сделать с данными ?" << endl;
    cout << "Используйте пункты меню для навигации в программе, нажмите :" << endl;
    cout << "[1] - если хотите отсортировать список клиентов по алфавиту" << endl;
    cout << "[2] - если отобрать клиентов, номер карты которых находится в заданном интервале" << endl;
    cout << "[0] - если хотите вернуться и ввести данные заново" << endl;
}

void informing::printOutputWays() {
    cout << "-----..........-----..........-----..........-----" << endl;
    cout << "Пожалуйста выберете, как вы хотите получить список ?" << endl;
    cout << "Используйте пункты меню для навигации в программе, нажмите :" << endl;
    cout << "[1] - если хотите вывести данные в файл" << endl;
    cout << "[2] - если хотите вывести данные в консоль" << endl;
    cout << "[0] - если хотите вернуться и получить новый список или заполнить данные снова" << endl;
}

void informing::printInformFout() {
	cout << "-----..........-----..........-----..........-----" << endl;
	cout << "Вам предлагается ввести исходные данные в файл" << endl;
	cout << "Используйте пункты меню для навигации в программе, нажмите :" << endl;
	cout << "[1] - Записать" << endl;
	cout << "[0] - Не записывать и продолжить выполнение программы" << endl;
	cout << "-----..........-----..........-----..........-----" << endl;
}

void informing::printInformFin() {
	cout << "-----..........-----..........-----..........-----" << endl;
	cout << "Обратите внимание! Что данные об одном клиенте должны быть записаны на одной строке через / и без пробелов !" << endl;
	cout << "-----..........-----..........-----..........-----" << endl;
	cout << "Загрузить из: ";
}

void informing::printInformNameOfFile() {
	cout << "Введите название файла в который вы хотите сохранить результат" << endl;
}

void informing::printCorrect() {
	cout << "-----..........-----..........-----..........-----" << endl;
	cout << "Ваши данные были успешно записаны!" << endl;
	cout << "Обратите внимание! Были удалены данные о клиентах с отрицательными полями (номер карты, номер счета)" << endl;
}

void informing::printInfoSelectLow() {
	cout << "-----..........-----..........-----..........-----" << endl;
	cout << "Введите числовой интервал, чтобы получить список клиентов, номер карты которых находится в заданном интервале" << endl;
	cout << "Введите нижнюю границу интервала" << endl;
}

void informing::printInfoSelectUpper() {
	cout << "-----..........-----..........-----..........-----" << endl;
	cout << "Введите верхнюю границу интервала" << endl;
}
